// Суворий режим
"use strict"


//Задача №1
//Що потрапить в консоль?

//let someVar = 0;
//++someVar;

//if (someVar) {
//	console.log(someVar);
//}

/* Відповідь:
Оскільки в змінній задано число 0, до нього застосований інкремент,
який збільшує це число на 1, отже, із застосуванням заданої в задачі умови,
в консоль потрапить число 1.
*/

/*
Задача №2
За допомогою циклу FOR виведіть в консоль 10 рядків:
Пункт №1
Пункт №2
і т.д.

Відповідь:
*/
console.log('Задача №2')
let someList = "Пункт№"
	for (let i=1; i <= 10; ++i) {
console.log (someList + i)
}
/* 
1. створюємо змінну "Пункт№"
2. Створюємо цикл for з наступними умовами:
	1) початкове значення  і=1 ( оскільки цикл починається з пункту № 1)
	2) задаємо умову закінчення циклу ( при і < або = 10 ( за умовою задачі))
	3) задаємо крок, з яким буде виводитись результат до консолі
3. В консоль виводимо змінну з результатом циклу
*/



/*
Задача №3
Що потрапить в консоль ?
if (2 * 20 <= 10 || 30 / 2 < 5 && 10 <= "10" || 20 === "20") {
	console.log('000');
}

Відповідь:
1) 2*20 <= 10 false ( 40 не менше і не дорівнює 10)
2) 30/2 < 5  false (15 не менше 5)
3) 10 <="10" true 
4) 20 === "20" false ( оператор === не переводить рядок в число)
5) отримуємо :
	if ( false || false && true || false)
	Оскільки у оператора && вищий пріоритет, то в консоль не потрапить нічого.
*/


/*
Задача №4
Створіть функцію, яка повертає результат ділення числа a на число b з додаванням рядка "Результат ділення: "
Викличте функцію передаючі різні значення, у тому числі не передаючи зовсім.
Функція не має повертати NaN, Infinite або помилку
*/
console.log('Задача №4')

let a = ("")
let b = ("")
function calcDiv(a = 0, b = 0) {
	let result = a / b
	showMessage(result)
	if (a === 0 || b === 0) {
		console.log ("Error")
	} else if (typeof a !== "number" || b !== "number") {
		console.log ("Error")
	}	else {
		console.log(result)
	}
}
function showMessage() {
	console.log ("Результат ділення: ")
}
calcDiv("" , "")

/*
1. Створюємо змінні для розрахунку;
2. Створюємо функцію для заданої в умові дії;
3. Задаємо функції умовне вітвлення згідно з умовою задачі
Наче, працює)))
*/



/*
Задача №5
Створіть масив даних - 5 елементів, один з яких число 10
Обробіть масив за допомогою методу перебору
Перевіряйте елемент на відповідність числу 10, та у разі відповідності, виводьте в консоль 
*/
console.log('Задача №5')

let someArray = ["Winter", false, "Hi!", 10, 8]
someArray.forEach (value => {	
	if( value === 10) {			
		console.log (value)	
	}
})
